import React from "react";
import "./Randomtelugu.css";
class Randomtelugu extends React.Component {
    constructor() {
        super();
        this.state={
            quote:"click the button to get random telugu quotes"
        }
    }

    handleteluguquotes=()=>{
             const teluguquotes = [
  "సమయం విలువైనది, దానిని వృథా చేయకండి.",
  "నీవే నీ శక్తి, నీవే నీ గమ్యం.",
  "భయం విజయానికి అడ్డుగోడ.",
  "ప్రతి రోజు కొత్త ఆశతో మొదలుపెట్టు.",
  "విజయానికి పట్టుదల అవసరం.",
  "నీవు మారితేనే ప్రపంచం మారుతుంది.",
  "శ్రమే సాఫల్యానికి మూలం.",
  "ఓడిపోవడం తప్పు కాదు, ప్రయత్నించకపోవడమే తప్పు.",
  "పాజిటివ్ ఆలోచనలు జీవితాన్ని వెలిగిస్తాయి.",
  "ఆత్మవిశ్వాసం ఉన్నవాడిని ఎవ్వరూ ఆపలేరు.",
  "అనుభవమే గొప్ప బోధ.",
  "నిజం చెప్పే వాడు కొంతమందికి అసహ్యం.",
  "నైతికతను విస్మరించిన వ్యక్తి శాశ్వతంగా ఓడిపోతాడు.",
  "మాటలు మధురంగా ఉండాలి, మనసు మంచిగా ఉండాలి.",
  "ప్రతి తప్పు ఓ పాఠం.",
  "నిజాయితీ మనిషిని గొప్పవాడిని చేస్తుంది.",
  "పుస్తకాలు మౌనంగా ఉండే మంచి మిత్రులు.",
  "సందేహం విజ్ఞానానికి ద్వారం.",
  "ప్రేమ మాటల్లో కాదు, మనసులో ఉండాలి.",
  "ప్రేమ నమ్మకంతో ఉంటుంది, అవసరంతో కాదు.",
  "దూరం ప్రేమను తగ్గించదు, పరీక్షిస్తుంది.",
  "ప్రేమ అనేది చర్యల్లో చూపించాలి.",
  "హృదయం నమ్మిన ప్రేమ జీవితాంతం నిలుస్తుంది.",
  "నిజమైన స్నేహం శాశ్వతం.",
  "ఒక మంచి స్నేహితుడు జీవితాన్ని మార్చగలడు.",
  "స్నేహం అనేది సంబంధం కాదు, భావన.",
  "అవకాశం వస్తే వినియోగించు, రాకపోతే సృష్టించు.",
  "కలలు కంటూ ఉండటం సరిపోదు, వాటిని నిజం చేయాలి.",
  "శ్రద్ధ ఉంటే సాధ్యం కానిది ఏదీ లేదు.",
  "తప్పు చేసినవాడిని క్షమించడం బలమైనవాడి లక్షణం."
];
        this.setState({ quote: teluguquotes[Math.floor(Math.random() * teluguquotes.length)] });

    }
    render() {
    return (
        <div className="randomtelugu-container">
            <h1>{this.state.quote}</h1>
            <button onClick={this.handleteluguquotes}>click here</button>
        </div>
    );
}
}
export default Randomtelugu;